<!DOCTYPE html>
<html class="frame" lang="en">
<head>
	<meta http-equiv="Content-Type" content="text/html;charset=utf-8">
	<title>Service Canada 20 Years</title>

	<!-- JQUERY -->
	<script type="text/javascript" src="../../lib/jquery/jquery.min.js"></script>
	<!-- BOOTSTRAP -->
	<link type="text/css" rel="stylesheet" href="../../lib/bootstrap/css/bootstrap.min.yeti.css">
	<script type="text/javascript" src="../../lib/bootstrap/js/bootstrap-3.4.1.min.js"></script>
	<!-- REPORT SPECIFIC -->
	<link type="text/css" rel="stylesheet" href="../../css/model.css">
	<link type="text/css" rel="stylesheet" href="../../css/i18n.css">
	<script type="text/javascript" src="../../js/frame.js"></script>
	<script type="text/javascript" src="../../js/imageMapResizer.min.js"></script>
</head>

<body>
	<div class="panel panel-default root-panel">

		<div class="panel-heading root-panel-heading">
            <!-- Name -->
               <b>Service Canada 20 Years</b>

            <!-- If a View with Viewpoint -->
			   (<span class="i18n-viewpoint-"></span>)
			   <a class="glyphicon glyphicon-info-sign" id="hint-viewpoint_" target="hint"></a>
            <!-- Or if a model (i.e has Purpose method) -->
		</div>

		<div class="panel-body root-panel-body">
		    <!-- If this is a digram model (has children and no bounds) show the image -->
			   <img class="diagram" src="../images/id-307dc142a16d49d1a84241b3a70be64c.png" alt="Service Canada 20 Years" usemap="#id-307dc142a16d49d1a84241b3a70be64cmap"/>
			   <map name="id-307dc142a16d49d1a84241b3a70be64cmap">
				  		<area shape="rect" coords="13,288,670,361" href="../elements/id-b660cc3c04474f02be1a1ee354b257d4.html"  target="element">
				  		<area shape="rect" coords="517,156,670,265" href="../elements/id-916de50b3d774bb8b067cd0396a4cfd8.html"  target="element">
				  		<area shape="rect" coords="349,156,502,265" href="../elements/id-ee13d4e9b90046a39fd81e7ff21625f3.html"  target="element">
				  		<area shape="rect" coords="181,156,334,265" href="../elements/id-46303cb0a8dd4c60a1d9fc4e9e5dbb7f.html"  target="element">
				  		<area shape="rect" coords="13,156,166,265" href="../elements/id-e06365a54eea43759cfeba90c4f18057.html"  target="element">
				          <area shape="rect" coords="589,10,738,118" href="../objects/id-c756cf6177934102a5baf27b93862ff7.html" target="element" >
				          <area shape="rect" coords="470,10,590,64" href="../objects/id-bfe35941e304453a93322540e7a8dd6c.html" target="element" >
				          <area shape="rect" coords="10,10,590,128" href="../objects/id-e29d995a2ccc468290fa8ac707786521.html" target="element" >

			   </map>

			<div role="tabpanel">
				<!-- Nav tabs -->
				<ul class="nav nav-tabs" role="tablist">
                    <!-- Purpose / Documentation / Content -->
					   <li role="presentation" class="active"><a href="#documentation" aria-controls="documentation" role="tab" data-toggle="tab" class="i18n-documentation"></a></li>

                    <!-- Properties -->
                    <li role="presentation"><a href="#properties" aria-controls="properties" role="tab" data-toggle="tab" class="i18n-properties"></a></li>

                    <!-- Analysis -->

						<li role="presentation"><a href="#elements" aria-controls="elements" role="tab" data-toggle="tab" class="i18n-elements"></a></li>
						<li role="presentation"><a href="#relationships" aria-controls="relationships" role="tab" data-toggle="tab" class="i18n-relationships"></a></li>
                    <!-- Model, Query Tab -->
				</ul>

				<!-- Tab panes -->
				<div class="tab-content">
					<div role="tabpanel" class="tab-pane active" id="documentation">
						<div class="convertlinks documentation" style="white-space:pre-wrap">Joyeux anniversaire : C&#233;l&#233;bration des 20 ans de Service Canada / Happy anniversary: Celebrating 20 years of Service Canada

From: Ministres / Ministers (EDSC/ESDC)
Sent: September 25, 2025 1:37 PM
Subject: Joyeux anniversaire : C&#233;l&#233;bration des 20 ans de Service Canada / Happy anniversary: Celebrating 20 years of Service Canada

(English follows the French)
 
L&#233;gende : Message de la ministre &#8211; Un message pour les employ&#233;s d&#8217;EDSC
Chers coll&#232;gues,
Il y a 20 ans cette semaine, le gouvernement f&#233;d&#233;ral a pris une grande d&#233;cision : cr&#233;er Service Canada, en tant que point d&#8217;acc&#232;s unique o&#249; les Canadiens pourraient recevoir un vaste &#233;ventail de prestations et de services gouvernementaux con&#231;us pour les aider &#224; traverser toutes les &#233;tapes de la vie.
Depuis 20 ans, Service Canada remplit cette mission, et en a fait bien plus encore. Par t&#233;l&#233;phone, en personne dans les Centres Service Canada, aux sites de services mobiles dans les communaut&#233;s, et dans les coulisses de nos centres de traitement, Service Canada a &#233;t&#233; une pr&#233;sence fiable dans tout le pays, jour apr&#232;s jour, m&#234;me dans les circonstances les plus difficiles. Les exemples suivants ne sont que quelques-unes des fa&#231;ons dont Service Canada change la donne :
Renforcer le filet de s&#233;curit&#233; sociale du Canada
Personne ne devrait &#234;tre laiss&#233; pour compte dans notre pays. Service Canada joue un r&#244;le essentiel pour &#233;liminer les obstacles et cr&#233;er des possibilit&#233;s &#233;conomiques pour tous. C&#8217;est pourquoi, &#224; un moment o&#249; faisons face aux graves cons&#233;quences de la guerre commerciale avec l&#8217;un de nos plus importants partenaires commerciaux, l&#8217;assurance-emploi demeure la pierre angulaire du filet de s&#233;curit&#233; sociale du Canada en soutenant les travailleurs lorsque survient une perte d&#8217;emploi, un cong&#233; parental ou une maladie ou lorsqu&#8217;ils doivent assumer des responsabilit&#233;s d&#8217;aidant naturel.
&#201;largir l&#8217;acc&#232;s aux programmes essentiels
Service Canada continue d&#8217;&#233;largir l&#8217;acc&#232;s &#224; des programmes essentiels qui favorisent la sant&#233; et le bien-&#234;tre financier des Canadiens. Le lancement du R&#233;gime canadien de soins dentaires a ouvert la voie &#224; des soins dentaires abordables aux personnes admissibles &#224; travers le pays. Plus r&#233;cemment, Service Canada a amorc&#233; le traitement des demandes pour la Prestation canadienne pour les personnes handicap&#233;es, qui offre du soutien financier direct aux personnes en situation de handicap. 
Ce travail va au-del&#224; de l&#8217;&#233;quit&#233;, il s&#8217;agit de cr&#233;er un v&#233;ritable changement, de favoriser l&#8217;autonomie des individus et d&#8217;aider les Canadiens &#224; b&#226;tir un avenir plus solide en leur permettant de s&#8217;&#233;panouir pleinement.
Moderniser et am&#233;liorer la prestation des services
&#192; mesure que les besoins des Canadiens &#233;voluent, Service Canada a &#233;largi son offre afin de fournir du soutien plus accessible et plus r&#233;actif. L&#8217;une des principales avanc&#233;es a &#233;t&#233; l&#8217;am&#233;lioration des outils libre-service pour les clients de la S&#233;curit&#233; de la vieillesse (SV). Aujourd&#8217;hui, plus de 7,4 millions de Canadiens peuvent demander des prestations de la SV en ligne, mettre &#224; jour leurs renseignements personnels, t&#233;l&#233;charger des documents et acc&#233;der &#224; leurs relev&#233;s fiscaux ou les t&#233;l&#233;charger, le tout gr&#226;ce &#224; un service num&#233;rique simplifi&#233;. 
Notre force, ce sont nos employ&#233;s
Que ce soit en offrant du soutien &#224; des millions de Canadiens, en assurant l&#8217;acc&#232;s &#224; des prestations et services ou en retroussant nos manches en situation de crise nationale comme la pand&#233;mie de COVID 19, les employ&#233;s de Service Canada sont toujours &#224; la hauteur de la t&#226;che par leur d&#233;vouement, leur compassion et leur professionnalisme.
Ce 20e anniversaire, c&#8217;est davantage qu&#8217;un chiffre. C&#8217;est l&#8217;occasion de rendre hommage aux personnes qui &#339;uvrent dans l&#8217;ombre du nom de Service Canada, aux personnes qui travaillent, jour apr&#232;s jour, pour offrir aux Canadiens le soutien dont ils ont besoin. L&#8217;engagement &#224; servir le public n&#8217;est pas toujours facile &#224; respecter, mais d&#8217;avoir la confiance des Canadiens au quotidien est une r&#233;compense plus que suffisante.
Notre objectif pour l&#8217;avenir : renforcer la promesse faite par le gouvernement aux Canadiens et rendre les services gouvernementaux plus inclusifs, accessibles et ax&#233;s sur le public.
La contribution que vous apportez est inestimable et instrumentale au succ&#232;s du Canada, g&#233;n&#233;ration apr&#232;s g&#233;n&#233;ration.
Merci pour tout votre travail et bravo pour ces 20 ann&#233;es au service de notre pays et de nos collectivit&#233;s.
L&#8217;honorable Patty Hajdu
(Elle)
La ministre de l&#8217;Emploi et des Familles et ministre responsable de l&#8217;Agence f&#233;d&#233;rale de d&#233;veloppement &#233;conomique pour le Nord de l&#8217;Ontario
Ce message a &#233;t&#233; approuv&#233; par EDSC. Visitez iService si vous &#234;tes pr&#233;occup&#233;s par l&#8217;authenticit&#233; du message.
 

Caption: Minister&#8217;s Message &#8211; A message for ESDC employees
Dear colleagues,
Two decades ago, the federal government took an important step to establish Service Canada as a single point of access where Canadians could receive a wide range of government benefits and services designed to support them through life&#8217;s many transitions.
For 20 years, Service Canada has fulfilled that mission&#8212;and done so much more. By phone, in-person at Service Canada Centres, at community outreach sites, and behind the scenes in our processing centres, Service Canada has been a reliable presence across the country&#8212;day in and day out&#8212;even in the most challenging circumstances. The following examples highlight just some of the ways Service Canada is making a difference:
Strengthening Canada&#8217;s social safety net
Nobody should be left behind in this country. Service Canada&#8217;s role is critical in breaking down barriers and building economic opportunity for all. That is why, as we&#8217;re navigating the serious consequences of the trade war with one of our most important trade partners, Employment Insurance (EI) remains a cornerstone of Canada&#8217;s social safety net, supporting workers through job loss, parental leave, illness and caregiving responsibilities. 
Expanding access to essential programs
Service Canada continues to broaden access to vital programs that support Canadians&#8217; health and financial well-being. The launch of the Canadian Dental Care Plan has opened the door to affordable dental care for eligible individuals across the country. More recently, Service Canada began processing applications for the Canada Disability Benefit, delivering direct financial support to persons with disabilities.
This work goes beyond fairness&#8212;it&#8217;s about creating meaningful change, empowering individuals, and helping Canadians build a stronger future by unlocking their full potential.
Modernizing and improving service delivery
As Canadians&#8217; needs continue to evolve, Service Canada has expanded its offerings to provide more accessible and responsive support. One key advancement has been the enhancement of self-serve tools for Old Age Security (OAS) clients. Today, more than 7.4 million Canadians can apply for OAS benefits online, update personal information, upload documents and access or download their tax slips&#8212;all through a streamlined digital service. 
Our strength is our people
Whether it&#8217;s providing support to millions of Canadians to ensuring access to benefits and services or stepping up during times of national crises like the COVID-19 pandemic, Service Canada employees have consistently shown that they are up to the task through their dedication, compassion and professionalism.
This 20-year anniversary goes far beyond a number, it's a celebration of the people behind the name, those who work to make sure Canadians have the support they need. Commitment to public service isn&#8217;t always easy, but earning the trust of Canadians every day makes it all worth it. 
As we move forward, let&#8217;s build on the Government&#8217;s commitment to Canadians: to make government services more inclusive, accessible and focused on people. 
Your contributions are highly valued and instrumental to Canada&#8217;s success, across generations.
Thank you for your work, and congratulations on 20 years of service to our country and communities. 

The Honourable Patty Hajdu
(She/her/hers)

Minister of Jobs and Families and Minister responsible for the Federal Economic Development Agency for Northern Ontario
This message has been approved by ESDC. Visit iService if you are concerned about the authenticity of the message.</div>
					</div>
					<div role="tabpanel" class="tab-pane" id="properties">
						<table class="table table-striped table-hover table-condensed">
							<thead>
								<tr>
									<th class="i18n-key"></th>
									<th class="i18n-value"></th>
								</tr>
							</thead>
							<tbody>
							</tbody>
						</table>
					</div>
					<div role="tabpanel" class="tab-pane" id="analysis">
						<table class="table table-striped table-hover table-condensed" id="used-in-views">
							<thead>
								<tr><th colspan="2" class="i18n-used-in-views" /></tr>
								<tr>
									<th class="i18n-name"></th>
									<th class="i18n-viewpoint"></th>
								</tr>
							</thead>
							<tbody>
							</tbody>
						</table>
						<table class="table table-striped table-hover table-condensed" id="model-relations">
							<thead>
								<tr><th colspan="4" class="i18n-model-relations" /></tr>
								<tr>
									<th class="i18n-name"></th>
									<th class="i18n-type"></th>
									<th class="i18n-source"></th>
									<th class="i18n-target"></th>
								</tr>
							</thead>
							<tbody>
							</tbody>
						</table>
					</div>
						<div role="tabpanel" class="tab-pane" id="elements">
							<table class="table table-striped table-hover table-condensed">
								<thead>
									<tr>
										<th class="i18n-name"></th>
										<th class="i18n-type"></th>
									</tr>
								</thead>
								<tbody>
									        <tr>
									           <td> <a href="../objects/id-e29d995a2ccc468290fa8ac707786521.html" target="element">  </a> </td>
									           <td> <a href="../objects/id-e29d995a2ccc468290fa8ac707786521.html" target="element" class="i18n-elementtype-DiagramModelNote"> </a> </td>
									        </tr>

									        <tr>
									           <td> <a href="../objects/id-bfe35941e304453a93322540e7a8dd6c.html" target="element">  </a> </td>
									           <td> <a href="../objects/id-bfe35941e304453a93322540e7a8dd6c.html" target="element" class="i18n-elementtype-DiagramModelNote"> </a> </td>
									        </tr>

									        <tr>
									           <td> <a href="../objects/id-c756cf6177934102a5baf27b93862ff7.html" target="element">  </a> </td>
									           <td> <a href="../objects/id-c756cf6177934102a5baf27b93862ff7.html" target="element" class="i18n-elementtype-DiagramModelNote"> </a> </td>
									        </tr>

											<tr>
											    <td> <a href="../elements/id-e06365a54eea43759cfeba90c4f18057.html" target="element"> Strengthening Canada&#8217;s social safety net | Renforcer le filet de s&#233;curit&#233; sociale du Canada </a> </td>
											    <td> <a href="../elements/id-e06365a54eea43759cfeba90c4f18057.html" target="element" class="i18n-elementtype-Value">
											    </a> </td>
											</tr>

											<tr>
											    <td> <a href="../elements/id-46303cb0a8dd4c60a1d9fc4e9e5dbb7f.html" target="element"> Expanding access to essential programs | &#201;largir l&#8217;acc&#232;s aux programmes essentiels </a> </td>
											    <td> <a href="../elements/id-46303cb0a8dd4c60a1d9fc4e9e5dbb7f.html" target="element" class="i18n-elementtype-Value">
											    </a> </td>
											</tr>

											<tr>
											    <td> <a href="../elements/id-ee13d4e9b90046a39fd81e7ff21625f3.html" target="element"> Modernizing and improving service delivery | Moderniser et am&#233;liorer la prestation des services </a> </td>
											    <td> <a href="../elements/id-ee13d4e9b90046a39fd81e7ff21625f3.html" target="element" class="i18n-elementtype-Value">
											    </a> </td>
											</tr>

											<tr>
											    <td> <a href="../elements/id-916de50b3d774bb8b067cd0396a4cfd8.html" target="element"> Our strength is our people | Notre force, ce sont nos employ&#233;s </a> </td>
											    <td> <a href="../elements/id-916de50b3d774bb8b067cd0396a4cfd8.html" target="element" class="i18n-elementtype-Value">
											    </a> </td>
											</tr>

											<tr>
											    <td> <a href="../elements/id-b660cc3c04474f02be1a1ee354b257d4.html" target="element"> Government&#8217;s commitment to Canadians: to make government services more inclusive, accessible and focused on people | La promesse faite par le gouvernement aux Canadiens et rendre les services gouvernementaux plus inclusifs, accessibles et ax&#233;s sur le public </a> </td>
											    <td> <a href="../elements/id-b660cc3c04474f02be1a1ee354b257d4.html" target="element" class="i18n-elementtype-Principle">
											    </a> </td>
											</tr>


								</tbody>
							</table>
						</div>
						<div role="tabpanel" class="tab-pane" id="relationships">
							<table class="table table-striped table-hover table-condensed">
								<thead>
									<tr>
										<th class="i18n-name"></th>
										<th class="i18n-type"></th>
										<th class="i18n-source"></th>
										<th class="i18n-target"></th>
									</tr>
								</thead>
								<tbody>
											<!-- DEBUG: Skipping element from class com.archimatetool.model.impl.DiagramModelNote -->
											<!-- DEBUG: Skipping element from class com.archimatetool.model.impl.DiagramModelNote -->
											<!-- DEBUG: Skipping element from class com.archimatetool.model.impl.DiagramModelNote -->

								</tbody>
							</table>
						</div>
			  </div>
			</div>
		</div>
	</div>
	<script type="text/javascript">imageMapResize();</script>
</body>
</html>